//=============================================================
//
// 円形のゲージ [sphereGage.h]
// Author:YUTO YOSHIDA
//
//=============================================================

#ifndef _SPHEREGAGE_H_
#define _SPHEREGAGE_H_

//*************************************************************
// インクルードファイル
//*************************************************************
#include"main.h"

//*************************************************************
//プロトタイプ宣言
//*************************************************************
void InitSphere(void);//円形のゲージの初期化処理
void UninitSphere(void);//円形のゲージの終了処理
void UpdateSphere(void);//円形のゲージの更新処理
void DrawSphere(void);//円形のゲージの描画処理

#endif